# Rebar Container Append Item From Curves Method

Source: https://www.revitapidocs.com/2026/f6907af6-1a9d-092d-1476-7a4ce3d883df.htm

---

| Rebar Container Append Item From Curves Method |
| --- |

Overload List

|  | Name | Description |
| --- | --- | --- |
|  | AppendItemFromCurves(RebarStyle, RebarBarType, RebarHookType, RebarHookType, XYZ, IList Curve , RebarHookOrientation, RebarHookOrientation, Boolean, Boolean) | **Obsolete.** |
|  | AppendItemFromCurves(RebarStyle, RebarBarType, RebarHookType, RebarHookType, XYZ, IList Curve , RebarTerminationOrientation, RebarTerminationOrientation, Boolean, Boolean) |  |

Top See Also

#### Reference

RebarContainer Class Autodesk.Revit.DB.Structure Namespace